DataProcessors/СозданиеИОтправкаЗаказовСтороннимСкладам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СозданиеИОтправкаЗаказовСтороннимСкладам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаОтбора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныКорректировкиСборки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтказПоставщика</Name>
					<Comment>!не используется с 09 февраля 2016</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныЗакрытияЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартийТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ) Процент скидки (если данная скидка детализируется по позициям номенклатуры, то является значением по умолчанию)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроцентАвтоматическихСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УсловиеАвтоматическойСкидки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловияАвтоматическойСкидки</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТолькоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаказовПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказСвязи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДнейПроизводственногоКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДнейПроизводственногоКалендаря</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>(Общ) Рабочий день</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПричиныКорректировкиСборки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПричиныКорректировкиСборки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пересорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недопоставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИстекСрокРезервирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаКратности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/СозданиеИОтправкаЗаказовСтороннимСкладам/Ext/ObjectModule.bsl
Функция ОтправитьЗаказыВSI(СтороннийСклад = Неопределено) Экспорт
	
	КодОшибки = "";
	
	Запрос = Новый Запрос();
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаказПоставщику.Ссылка
	|ИЗ
	|	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	|ГДЕ
	|	ЗаказПоставщику.Проведен = ИСТИНА
	|	И ЗаказПоставщику.СтатусЗаказаПоставщику = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовПоставщикам.Создан)
	|	И ВЫБОР
	|			КОГДА &ОтборПоСкладу
	|				ТОГДА ЗаказПоставщику.IDСклада В (&СтороннийСклад)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ЗаказПоставщику.Дата МЕЖДУ &ДатаНач И &ДатаКон
	|	И ЗаказПоставщику.IDСклада.СтороннийСкладФилиала = ИСТИНА
	|	И ЗаказПоставщику.IDСклада.НеОтправлятьЗаказыВSI = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщику.Экспресс УБЫВ";
	
	Запрос.Параметры.Вставить("ОтборПоСкладу", ?(СтороннийСклад = Неопределено, Ложь, Истина));
	Запрос.Параметры.Вставить("СтороннийСклад", СтороннийСклад);
	Запрос.Параметры.Вставить("ДатаНач", НачалоДня(ДатаОтбора));
	Запрос.Параметры.Вставить("ДатаКон", КонецДня(ДатаОтбора));
	
	РезЗапроса = Запрос.Выполнить();
	
	Если РезЗапроса.Пустой() Тогда
		Возврат КодОшибки;
	КонецЕсли;
	
	Выборка = РезЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			
			Результат = Документы.ЗаказПоставщику.ОтправитьвSI(Выборка.Ссылка);
			
			Если Результат.Статус = "OK" Тогда
				
				Документобъект = Выборка.Ссылка.ПолучитьОбъект();
				Документобъект.СтатусЗаказаПоставщику = Перечисления.СтатусыЗаказовПоставщикам.ОтправленПоставщику;
				Документобъект.Записать(РежимЗаписиДокумента.Проведение);				
				
			ИначеЕсли Результат.Статус = "NO_COMMAND" Тогда
			Иначе
				КодОшибки = КодОшибки + "Ошибка отправки документа:" + Выборка.Ссылка + Символы.ПС + Результат.Сообщение + Символы.ПС;
			КонецЕсли;
			
		Исключение
			КодОшибки = КодОшибки + "Не удалось отправить в SI документ: " + Выборка.Ссылка + Символы.ПС + ОписаниеОшибки() + Символы.ПС;
		КонецПопытки;	
		
	КонецЦикла;
	
	Возврат КодОшибки;
			
КонецФункции

Функция ВыполнитьДействия(ЗапущеноРегламентом = Ложь) Экспорт 
	
	КодОшибки = "";

	Запрос = Новый  Запрос;
	Запрос.УстановитьПараметр("ТекДата",             НачалоДня(ДатаОтбора));
	Запрос.УстановитьПараметр("РабочийДень",         Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий);
	Запрос.УстановитьПараметр("ПредпраздничныйДень", Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	РегламентированныйПроизводственныйКалендарь.ВидДня
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря = &ТекДата";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		КодОшибки = "Не заполнен регламентированны календарь на " + НачалоДня(ТекущаяДата());
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Рабочий Тогда
				
				ПолеОтбора = "ОтправлятьПоРабочмДням";
				ВремяОтбора = "ВремяОтправкиРабочийДень";
				
			ИначеЕсли Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Суббота Тогда 				
				ПолеОтбора = "ОтправлятьПоСубботам";
				ВремяОтбора = "ВремяОтправкиСуббота";
			ИначеЕсли Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Воскресенье Тогда 
				
				ПолеОтбора = "ОтправлятьПоВоскресеньям";
				ВремяОтбора = "ВремяОтправкиВоскресенье";
				
			ИначеЕсли Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Предпраздничный Тогда 
				
				ПолеОтбора = "ОтправлятьВПредраздничныеДни";
				ВремяОтбора = "ВремяОтправкиПредпрздничныйДень";
				
			ИначеЕсли Выборка.ВидДня = Перечисления.ВидыДнейПроизводственногоКалендаря.Праздник Тогда 
				
				ПолеОтбора = "ОтправлятьВПраздничныеДни";
				ВремяОтбора = "ВремяОтправкиПраздничныйДень";
				
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СторонниеСклады.Ссылка
			|ИЗ
			|	Справочник.СторонниеСклады КАК СторонниеСклады
			|ГДЕ
			|	СторонниеСклады.ОтправлятьВАварду
			|	И СторонниеСклады.ОтправлятьПоРабочмДням
			|	И (СторонниеСклады.ВремяОтправкиРабочийДень <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень, СЕКУНДА) <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень, СЕКУНДА) >= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА) - 10 * 60
			|			ИЛИ СторонниеСклады.ВремяОтправкиРабочийДень2 <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень2, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень2, СЕКУНДА) <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень2, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень2, СЕКУНДА) >= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА) - 10 * 60
			|			ИЛИ СторонниеСклады.ВремяОтправкиРабочийДень3 <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень3, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень3, СЕКУНДА) <= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА)
			|				И РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(СторонниеСклады.ВремяОтправкиРабочийДень3, ДЕНЬ), СторонниеСклады.ВремяОтправкиРабочийДень3, СЕКУНДА) >= РАЗНОСТЬДАТ(НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ), &ТекущаяДата, СЕКУНДА) - 10 * 60)";
			
			Запрос.УстановитьПараметр("ТекущаяДата", ДатаОтбора);
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОтправлятьПоРабочмДням", ПолеОтбора);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВремяОтправкиРабочийДень", ВремяОтбора);
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЗаказыПокупателейОстатки.ЗаказПокупателя
				|ПОМЕСТИТЬ ТЗаказов
				|ИЗ
				|	РегистрНакопления.ЗаказыПокупателей.Остатки КАК ЗаказыПокупателейОстатки
				|ГДЕ
				|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0
				|	И ЗаказыПокупателейОстатки.ЗаказПокупателя.IDСклада_СтороннийСклад = &IDСклада_СтороннийСклад
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ТЗаказов.ЗаказПокупателя  КАК Ссылка
				|ИЗ
				|	ТЗаказов КАК ТЗаказов
				|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
				|		ПО ТЗаказов.ЗаказПокупателя = ЗаказПокупателяТовары.Ссылка
				|ГДЕ
				|	ЗаказПокупателяТовары.ЦенаЗакупки = 0";
				
				Запрос.УстановитьПараметр("IDСклада_СтороннийСклад", ВыборкаДетальныеЗаписи.Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				ВыборкаЗаказ = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаЗаказ.Следующий() Цикл
					
					НоваяКорректировкаЗаказаПокупателя = Документы.КорректировкаЗаказаПокупателя.СоздатьДокумент();
					НоваяКорректировкаЗаказаПокупателя.Дата = Макс(ВыборкаЗаказ.Ссылка.Дата + 1, ТекущаяДата() - 121);
					НоваяКорректировкаЗаказаПокупателя.Заполнить(ВыборкаЗаказ.Ссылка);
					
					Если НоваяКорректировкаЗаказаПокупателя.Товары.Количество() <> 0 Тогда 
						
						Для Каждого ТекСтрока Из НоваяКорректировкаЗаказаПокупателя.Товары Цикл 
							ТекСтрока.Причина = Перечисления.ПричиныКорректировкиСборки.ОтказПоставщика; 
						КонецЦикла;
						
						НоваяКорректировкаЗаказаПокупателя.Комментарий = "Создан автоматически обработкой создания и отправки заказов сторонним складам.";
						
						Попытка
							НоваяКорректировкаЗаказаПокупателя.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
						КонецПопытки;
						
					КонецЕсли;
					
				КонецЦикла;
				
				// создаем заказы  поставщику
				НовыйОтчет = Отчеты.АнализЗаказовПокупателей.Создать();
				НовыйОтчет.УстановитьНачальныеНастройки_Сервер();
				НовыйОтчет.ЗаказПоставщику(Ложь, Неопределено, ВыборкаДетальныеЗаписи.Ссылка, ЗапущеноРегламентом);
				
			КонецЦикла;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат КодОшибки;
	
КонецФункции
